Revit 2027 API
EdgeArrayArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual EdgeArrayArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As EdgeArrayArrayIterator
public:
virtual EdgeArrayArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> EdgeArrayArrayIterator
override ReverseIterator : unit -> EdgeArrayArrayIterator
Return Value
EdgeArrayArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
EdgeArrayArray Class
Autodesk.Revit.DB Namespace